#+begin_src js
  const range = a => [...Array(a).fill().keys()].map(Number)

  const lrf = a => Math.floor(Math.sqrt(a.length))

  const toSqM = a => range(lrf(a)).map(b => a.slice(b*lrf(a), (b+1)*lrf(a)))

  Array.prototype.scan = function (fn, init=Symbol.for("null")) {
      const res = range(this.length).map(a => this.slice(0, a+1))
      return init == Symbol.for("null")
          ? ( res[0] = [res[0]]
              , res.map(a => a.reduce(fn)))
          : res.map(a => a.reduce(fn, init))
  }

  return range(6).reverse().scan((_,__,___,a) => a)
#+end_src

#+RESULTS:
| 5 |   |   |   |   |   |
| 5 | 4 |   |   |   |   |
| 5 | 4 | 3 |   |   |   |
| 5 | 4 | 3 | 2 |   |   |
| 5 | 4 | 3 | 2 | 1 |   |
| 5 | 4 | 3 | 2 | 1 | 0 |
